// ignore_for_file: file_names

import 'package:heikemonogatari_game/model/question.dart';

final questionItem = {
  1: Question(
    choices: ["祇園精舎の", "紫の門の", "高輪よしのの", "赤い門の", "御殿山の", "鶴見の滝の", "花見小路の", "六義園の", "志野山の"],
    answer: "祇園精舎の",
    audioFilePath: "001_ずんだもん（ノーマル）_ぎおんしょうじゃの.wav"
  ),
  2: Question(
    choices: ["鐘の声", "鐘の音", "鐘の響き", "鐘のよろこび", "鐘のさざめき", "鐘のチャイム", "鐘のブラブラ", "鐘の音色", "鐘の鳴り響く"],
    answer: "鐘の声",
    audioFilePath: "002_ずんだもん（ノーマル）_かねのこえ.wav"
  ),
  3: Question(
    choices: ["諸行無常の", "流れ星の", "流転の", "浮世の", "転輪の", "千転万転の", "一朝一夕の", "瞬息万変の", "輪回の"],
    answer: "諸行無常の",
    audioFilePath: "003_ずんだもん（ノーマル）_しょぎょうむじょうの.wav"
  ),
  4: Question(
    choices: ["響きあり", "響く", "響き渡る", "響き残る", "響き澄ます", "回響する", "反響する", "響き渡る音", "響きある声"],
    answer: "響きあり",
    audioFilePath: "004_ずんだもん（ノーマル）_ひびきあり.wav"
  ),
  5: Question(
    choices: ["娑羅双樹の", "蓮華茶屋の", "折花の池の", "西洞院の", "金閣寺の", "清涼荘の", "高林寺の", "山村荘の", "千本鳥居の"],
    answer: "娑羅双樹の",
    audioFilePath: "005_ずんだもん（ノーマル）_しゃらそうじゅの.wav"
  ),
  6: Question(
    choices: ["花の色", "桜の色", "牡丹の色", "菊の色", "薔薇の色", "椿の色", "桃の色", "梅の色", "苺の色"],
    answer: "花の色",
    audioFilePath: "006_ずんだもん（ノーマル）_はなのいろ.wav"
  ),
  7: Question(
    choices: ["盛者必衰の", "一期一会の", "二度あることは三度の", "三者三様の", "四面楚歌の", "五月雨の", "六甲山の", "七転八起の", "八方美人の"],
    answer: "盛者必衰の",
    audioFilePath: "007_ずんだもん（ノーマル）_じょうしゃひっすいの.wav"
  ),
  8: Question(
    choices: ["理をあらはす", "理を明確にする", "理を説明する", "理を示す", "理を明らかにする", "理を伝える", "理を論じる", "理を述べる", "理を述す"],
    answer: "理をあらはす",
    audioFilePath: "008_ずんだもん（ノーマル）_ことわりをあらわす.wav"
  ),
  9: Question(
    choices: ["驕れる人も", "自慢げな人も", "自惚れる人も", "自負する人も", "自慢気な人も", "自慢話をする人も", "自慢話をする者も", "自賛する人も", "自慢話をしている者も"],
    answer: "驕れる人も",
    audioFilePath: "009_ずんだもん（ノーマル）_おごれるひとも.wav"
  ),
  10: Question(
    choices: ["久しからず", "久しぶりに", "久し振りに", "久しぶりの", "久し振りの", "久しぶりで", "久し振りで", "久しぶりだ", "久し振りだ"],
    answer: "久しからず",
    audioFilePath: "010_ずんだもん（ノーマル）_ひさしからず.wav"
  ),
  11: Question(
    choices: ["ただ春の夜の", "ただ今の桜の夜の", "ただ今の春の夜の", "ただ今の花の夜の", "ただ今の夜桜の", "ただ今の夜春の", "ただ今の夜花の", "ただ今の桜の雨の夜の", "ただ今の夜の雨桜の"],
    answer: "ただ春の夜の",
    audioFilePath: "011_ずんだもん（ノーマル）_ただはるのよの.wav"
  ),
  12: Question(
    choices: ["夢のごとし", "夢のように", "夢のようで", "夢のような", "夢のようだ", "夢のかたちに", "夢のかたちで", "夢のかたちな", "夢のかたちだ"],
    answer: "夢のごとし",
    audioFilePath: "012_ずんだもん（ノーマル）_ゆめのごとし.wav"
  ),
  13: Question(
    choices: ["猛き者も", "凶暴な者も", "残忍な者も", "残酷な者も", "残忍である者も", "残酷である者も", "残忍であるものも", "残酷であるものも", "残忍なものも"],
    answer: "猛き者も",
    audioFilePath: "013_ずんだもん（ノーマル）_たけきものも.wav"
  ),
  14: Question(
    choices: ["つひにはほろびぬ", "ほろびることがない", "きえることがない", "くずれることがない", "こわれることがない", "ほろびぬ", "きえぬ", "くずれない", "こわれない"],
    answer: "つひにはほろびぬ",
    audioFilePath: "014_ずんだもん（ノーマル）_ついにはほろびぬ.wav"
  ),
  15: Question(
    choices: ["ひとへに", "だが", "けれど", "しかし", "ただ", "たが", "なお", "また", "然し"],
    answer: "ひとへに",
    audioFilePath: "015_ずんだもん（ノーマル）_ひとえに.wav"
  ),
  16: Question(
    choices: ["風の前の", "風の中の", "風の前での", "風の中での", "風の前にの", "風の中にの", "風に向かっての", "風に対しての", "風に向けての"],
    answer: "風の前の",
    audioFilePath: "016_ずんだもん（ノーマル）_かぜのまえの.wav"
  ),
  17: Question(
    choices: ["塵に同じ", "塵のように", "塵のようで", "塵のような", "塵のようだ", "塵のように見える", "塵のように思える", "塵のようである", "塵のようであるように"],
    answer: "塵に同じ",
    audioFilePath: "017_ずんだもん（ノーマル）_ちりにおなじ.wav"
  ),
};